// 27. Определить количество цифр в числе

Console.Clear();
Console.WriteLine("Введите число: ");
string Num = Console.ReadLine();
int length = Num.Length;
Console.WriteLine(length);
