// Найти третью цифру числа или сообщить, что её нет
Console.Clear();
Console.WriteLine("Введите любое число: ");
string NumberA = Convert.ToString(Console.ReadLine());
Console.WriteLine(NumberA[2]);

//if(NumberA[2]== 0) Console.WriteLine("В числе меньше трех цифр");
 
//string.Empty - пока не знаю как вывести что нет цифры
